{
    "Artificial Intelligence": [
      {
        "topic": "Introduction to AI",
        "summary": "Artificial Intelligence (AI) is a field of computer science focused on creating systems that can perform tasks that typically require human intelligence, such as learning, reasoning, and problem-solving."
      },
      {
        "topic": "Types of AI",
        "summary": "AI is categorized into Narrow AI (designed for specific tasks), General AI (human-like intelligence), and Super AI (beyond human intelligence, currently theoretical)."
      },
      {
        "topic": "Applications of AI",
        "summary": "AI is used in healthcare, finance, autonomous vehicles, robotics, and many other domains to automate and optimize processes."
      },
      {
        "topic": "AI Techniques",
        "summary": "AI employs techniques like machine learning, expert systems, natural language processing, and computer vision to simulate human intelligence."
      },
      {
        "topic": "Future of AI",
        "summary": "The future of AI includes advancements in general intelligence, ethical AI, job automation, and integration into daily life across various industries."
      }
    ],
    "Data Science": [
      {
        "topic": "Introduction to Data Science",
        "summary": "Data Science is an interdisciplinary field that combines statistics, computer science, and domain knowledge to extract insights and knowledge from data."
      },
      {
        "topic": "Data Science Lifecycle",
        "summary": "The lifecycle includes data collection, data cleaning, exploratory data analysis, model building, deployment, and monitoring."
      },
      {
        "topic": "Tools Used in Data Science",
        "summary": "Popular tools include Python, R, SQL, Jupyter Notebooks, and libraries like Pandas, NumPy, Scikit-learn, and TensorFlow."
      },
      {
        "topic": "Role of a Data Scientist",
        "summary": "A data scientist analyzes complex data, builds models, visualizes results, and provides actionable insights to support decision-making."
      },
      {
        "topic": "Applications of Data Science",
        "summary": "Used in fraud detection, recommendation systems, marketing analytics, healthcare predictions, and customer segmentation."
      }
    ],
    "Machine Language": [
      {
        "topic": "Introduction to Machine Learning",
        "summary": "Machine Learning (ML) is a subset of AI that enables computers to learn from data and make predictions or decisions without being explicitly programmed."
      },
      {
        "topic": "Types of ML",
        "summary": "Supervised learning (training with labeled data), unsupervised learning (finding patterns in unlabeled data), and reinforcement learning (learning via rewards and penalties)."
      },
      {
        "topic": "ML Algorithms",
        "summary": "Common ML algorithms include Linear Regression, Decision Trees, Random Forest, K-Nearest Neighbors (KNN), and Neural Networks."
      },
      {
        "topic": "Model Evaluation Metrics",
        "summary": "Metrics such as accuracy, precision, recall, F1 score, and ROC-AUC are used to evaluate ML model performance."
      },
      {
        "topic": "Applications of ML",
        "summary": "ML is applied in recommendation engines, email filtering, fraud detection, predictive analytics, and speech recognition."
      }
    ]
  }
  